# 形参: 在函数声明的位置编写的变量
# 1. 位置参数, 按照从左到右的顺序编写变量
# 2. 默认值参数, 在形参声明的时候, 直接给出一个默认值,
#           后续在访问到这个函数的时候. 该参数就可以不给出具体的数据, 直接使用默认值

# def func(a, b, c):
#     print(a, b, c)
#
#
# func(11, 222, 33)


# def func(name, age, gender="男"):  # 不给值, 有默认的, 如果给值, 就用你给出的值
#     print("录入名字", name)
#     print("录入年龄", age)
#     print("录入性别", gender)
#
#
# func("周杰伦", 18)
# func("王力宏", 12)
# func("周星驰", 19)
# func("周杰", 23)
# func("雷阿伦", 36)
# func("蔡依林", 22, "女")


# # 坑: 如果你的默认值参数是一个可变的数据类型, 会被共享
# def func(val, lst=[]):
#     lst.append(val)
#     print(lst)
#
#
# func(10086)  # [10086]
# func(10010)  # [10086, 10010]  两次访问使用的是同一个列表
# func(777888, [])  # [777888]



