# '''一   题目 1001: [编程入门]第一个HelloWorld程序            ---------------------------------------------------------------------------
# 学习了输出语句，请参照例题，编写一个程序，输出以下信息：
#
# **************************
# Hello World!
# **************************
#
# 注意：Hello与World之间有一个空格以及大小写问题
# *也是输出的一部分，别光打印Hello World！
# 输出格式
# **************************
# Hello World!
# **************************'''
#
#
# print('*'*30)
# print('Hello World!')
# print('*'*30)
#
#
#
# '''二  题目 1002: [编程入门]三个数最大值        -----------------------------------------------
# 编写一个程序，输入a、b、c三个值，输出其中最大值。
# 输入格式       一行数组，分别为a b c
# 输出格式       a b c其中最大的数
# 样例输入        10 20 30
# 样例输出        30'''
#
# l = input('请输入三个数字：')
# ll = l.strip()
# a,b,c = ll.split(' ')
# li = [a,b,c]
# print(max(li))
# print(li)
# print(type(li))




# '''三     题目 1003: [编程入门]密码破译           ----------------------------------------------------
# 要将"China"译成密码，译码规律是：用原来字母后面的第4个字母代替原来的字母．    例如，字母"A"后面第4个字母是"E"．"E"代替"A"。因此，"China"应译为"Glmre"。
# 请编一程序，用赋初值的方法使cl、c2、c3、c4、c5五个变量的值分别为，’C’、’h’、’i’、’n’、’a’，经过运算，使c1、c2、c3、c4、c5分别变为’G’、’l’、’m’、’r’、’e’，并输出。
# 输入格式   China
# 输出格式    加密后的China
# 样例输入      China
# 样例输出   Glmre'''
#
# import string
#
# english = string.ascii_letters
# m = input('请输入需要加密的单词:')
# mi = ''
# for i in m:
#     num = english.find(i)
#     mi = mi + english[num+4]
# print(mi)
#
#
# '''四，题目 1005: [编程入门]温度转换             --------------------------------------------------------
# 题目描述     输入一个华氏温度，要求输出摄氏温度。公式为 c=5(F-32)/9，取位2小数。
# 输入格式     一个华氏温度，浮点数
# 输出格式     摄氏温度，浮点两位小数
# 样例输入     -40
# 样例输出     c=-40.00'''
#
# hua = float(input('请输入华氏温度：'))
# h = round(hua,2)
# print(h)
# print(type(h))
# s = 5*(h-32)/9
# s = round(s,2)
# print(s)
#
#
# '''五，  1007: [编程入门]分段函数求值   -------------------------------------------------------------
# 题目描述
# 有一个函数
# y={  x      x<1
#     |  2x-1   1<=x<10
#     { 3x-11  x>=10
#
# 写一段程序，输入x，输出y
# 输入格式        一个数x
# 输出格式        一个数y
# 样例输入        14
# 样例输出        31'''
#
# def fenduan(x):
#     if x <1:
#         return x
#     elif 1<= x <10 :
#         return 2*x-1
#     else:
#         return 3*x-11
#
# # if __name__ == '__main__':
# x = int(input('输入x的值：'))
# print(fenduan(x))
#
#
# '''六，题目 1008: [编程入门]成绩评定        ---------------------------------------------------------------------
# 题目描述  给出一百分制成绩，要求输出成绩等级‘A’、‘B’、‘C’、‘D’、‘E’。 90分以及90分以上为A，80-89分为B，70-79分为C，60-69分为D，60分以下为E。
# 输入格式        一个整数0－100以内
# 输出格式        一个字符，表示成绩等级
# 样例输入        90
# 样例输出        A'''
#
#
#
# '''七，  题目 1009: [编程入门]数字的处理与判断     -------------------------------------------------
# 题目描述    给出一个不多于5位的整数，要求 1、求出它是几位数 2、分别输出每一位数字 3、按逆序输出各位数字，例如原数为321,应输出123
# 输入格式        一个不大于5位的数字
# 输出格式        三行 第一行 位数 第二行 用空格分开的每个数字，注意最后一个数字后没有空格 第三行 按逆序输出这个数
# 样例输入        12345
# 样例输出
# 5
# 1 2 3 4 5
# 54321'''
#
# num = input('请输入整数：')
# print(len(num))
# num1 = ''
# for i in num:
#     num1 = num1 +' '+ i
# print(num1[1::])
# print(num[::-1])
#
#
# '''八，题目 1010: [编程入门]利润计算     -=-------------------------------------------------------
# 企业发放的奖金根据利润I提成。
# 利润I低于或等于100000元的，奖金可提10%;
# 利润高于100000元，低于或等于200000元（100000<I≤200000）时，低于等于100000元部分按10％提成，高于100000元的部分，可提成 7.5%;
# 200000<I≤400000时，低于200000元部分仍按上述办法提成（下同），高于200000元的部分按5％提成；
# 400000<I≤600000元时，高于400000元的部分按3％提成；
# 600000<I≤1000000时，高于600000元的部分按1.5%提成；
# I>1000000时，超过1000000元的部分按1%提成。
# 从键盘输入当月利润I,求应发奖金总数。'''
#
# li = int(input('请输入本月利润：'))
# if li <= 100000:
#     ti = li*0.1
#     print('发放奖金：'+str(ti)+'元')
# elif 100000 < li <= 200000:
#     ti = 100000*0.1+(li-10000)*0.075
#     print('发放奖金：'+str(ti)+'元')
# elif 200000 < li <= 400000:
#     ti = 100000*0.1+(200000-100000)*0.075+(li-200000)*0.05
#     print('发放奖金：'+str(ti)+'元')
# elif 400000 < li <= 600000:
#     ti = 100000*0.1+(200000-100000)*0.075+(400000-200000)*0.05+(li-400000)*0.03
#     print('发放奖金：'+str(ti)+'元')
# elif 600000 < li <= 1000000:
#     ti = 100000*0.1+(200000-100000)*0.075+(400000-200000)*0.05+(600000-400000)*0.03+(li-600000)*0.015
#     print('发放奖金：'+str(ti)+'元')
# else:
#     ti = 100000*0.1+(200000-100000)*0.075+(400000-200000)*0.05+(600000-400000)*0.03+(1000000-600000)*0.015+(li-1000000)*0.01
#     print('发放奖金：'+str(ti)+'元')


# '''题目 1011: [编程入门]最大公约数与最小公倍数
# 时间限制: 2s 内存限制: 192MB   提交: 91766 解决: 50142
# 题目描述    输入两个正整数m和n，求其最大公约数和最小公倍数。
# 输入格式    两个整数
# 输出格式    最大公约数，最小公倍数
# 样例输入    5 7
# 样例输出    1 35'''
#
#
# a = int(input('请输入数字1：'))
# b = int(input('请输入数字2：'))
# ya = []
# yb = []
# def g_y_s(a,b):
#     for i in range(1,a+1):
#         if a%i == 0:
#             ya.append(i)
#     # for i in range(1,b+1):
#     #     if b%i == 0:
#     #         yb.append(i)
#     ya.sort(reverse=True)
#     print(ya)
#     # print(yb)
#     for i in ya:
#         if i in yb:
#             print(f'他们的最大公约数是{i}')
#             break
# g_y_s(a,b)
#
# ba = []
# bb = []
# def g_b_s(a,b):
#     for i in range(1,a+1):
#         bb.append(i*b)
#         bb.sort(reverse=False)
#     for i in range(1,b+1):
#         ba.append(i*a)
#         ba.sort(reverse=False)
#     print(bb)
#     print(ba)
#     for i in ba:
#         if i in bb:
#             print(f'他们的最小公倍数数是{i}')
#             break
# g_b_s(a,b)


# 优化
#
# def g_y_s(a,b):
#     for i in range(1,a+1):
#         if a%i == 0:
#             ya.append(i)
#     # for i in range(1,b+1):
#     #     if b%i == 0:
#     #         yb.append(i)
#     ya.sort(reverse=True)
#     # print(ya)
#     # print(yb)
#     for i in ya:
#         if b % i == 0:
#             return f'他们的最大公约数是{i}'
#             # break
# print('他们的最大公约数是:',g_y_s(a, b))

#
# # l = [1,3,9,4,2]
# # l.sort(reverse=True)
# # print(l)
# # print(16%3)

# a = 15
# if a%